---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.MoreThanOneDimsLabelToOneReportingParameter
source: html/22fb6184-5649-66a7-5197-73f745590659.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.MoreThanOneDimsLabelToOneReportingParameter Property

Reporting parameters can only exist on a single dimension/constraint.

## Syntax (C#)
```csharp
public static FailureDefinitionId MoreThanOneDimsLabelToOneReportingParameter { get; }
```